[
    {
      "Matières": "SPOC Sens critique : Sciences en sociétés",
      "ECTS": "",
      "Cours": "",
      "TD": "",
      "TP": ""
    },
    {
      "Matières": "SPOC Sens critique : Sciences en sociétés\r\n\r\n\r\n                                                \r\n              \r\n              \r\n                      \r\n      Modalités d'organisation et de suivi  :\r\n                        \r\n            Responsable :\r\n                          GAELLE GUYOT-ROUGE\r\n                      \r\n                                              \r\n        \r\n      Objectifs pédagogiques visés :\r\n                        \r\n            Objectifs d'apprentissage :\r\n                          Reconnaître des procédés argumentatifs récurrents, contribuant à la diffusion en sociétés de thèses non recevables au regard des connaissances établies.\r\n          Connaître certains outils, procédés et démarches permettant de caractériser scientifiquement des différences et identifier les interférences possibles entre l’élaboration des tels savoirs scientifiques et des constructions sociales.\r\n          Identifier les conditions auxquelles une observation scientifique est jugée crédible par la communauté scientifique \r\n          A propos d’une controverse socioscientifique, repérer et dissocier différents registres de discours concurrents (par exemple économique, éthique, scientifique)\r\n          Dépasser le registre binaire (V \r\n         vs F) pour appréhender la complexité des controverses socioscientifiques\r\n                      \r\n                                \r\n            Programme/plan/contenus :\r\n                          Le SPOC Sens critique/ sicences en sociétés est un enseignement en ligne destiné à sensibiliser les étudiants aux enjeux des interactions sciences et sociétés en développant leur sens critique. \r\n             Il est constitué de cinq séances d'exercices ludiques portant sur des ressources audio, video et textuelles. Chaque séance est rattachée d'une part à un thème envisageant un champ spécifique de connaissances scientifiques, d'autre part à un questionnement interrogeant un aspect spécifique des interactions sciences/sociétés.\r\n             Séance 1 : La terre plate : Quels procédés argumentatifs peuvent contribuer à faire accepter en société des thèses irrecevables eu égard aux connaissances établies ?\r\n             Séance 2 : Le dimorphisme sexuel du cerveau : Quelle part les savoirs scientifiques peuvent-ils prendre dans les constructions sociales ? Réciproquement, quelle part les constructions sociales peuvent-elles prendre dans l’élaboration des savoirs ?\r\n             Séance 3 : Les ondes gravitationnelles : A quelles conditions des observations scientifiques sont-elles considérées comme fiables par les communautés de chercheurs ?\r\n             Séance 4 : Le transhumanisme : A quel imaginaire, à quelle économie, et à quelles pratiques scientifiques institutionnelles le transhumanisme est-il relié ?\r\n             Séance 5 : Le transhumanisme : Que peuvent modifier sur le plan social, politique, juridique et anthropologique, les évolutions technoscientifiques ?\r\n                      \r\n                                                                                        \r\n            Modalités pédagogiques particulières\r\n                          Enseignement en ligne, suivi sur ecampus, évaluation en ligne, forum, démarrage en janvier 2021.\r\n          5 séances, chacune en ligne 2 semaines."
    },
    {
      "Matières": "Projet Math-info",
      "ECTS": 4,
      "Cours": "",
      "TD": 30,
      "TP": ""
    },
    {
      "Matières": "Projet Math-info\r\n\r\n\r\n                            \r\n        Langue d'enseignement :\r\n          Français\r\n        \r\n      \r\n                          \r\n        ECTS :\r\n          4\r\n        \r\n      \r\n            \r\n      Détail du volume horaire :\r\n                                      \r\n            Travaux dirigés :\r\n                          30\r\n                      \r\n                                                                                                                    \r\n  \r\n              \r\n              \r\n                      \r\n      Modalités d'organisation et de suivi  :\r\n                                                    \r\n        \r\n      Objectifs pédagogiques visés :\r\n                        \r\n            Objectifs d'apprentissage :\r\n                          Utiliser l'outil informatique pour aborder des problèmes mathématiques avancés, développer son autonomie et sa démarche de recherche face à un problème\r\n                      \r\n                                \r\n            Programme/plan/contenus :\r\n                          L'interaction entre les mathématiques et l'informatique se retrouve dans de nombreux domaines actuels. Dans cette UE, on découvre des exemples concrets de cette interaction et des outils pour la mettre en place.     A travers des fiches de TP et des projets, les étudiants découvrent la programmation sous SageMath (python). Les premières fiches sont très guidées pour permettre un apprentissage progressif et adapté à chacun. Ensuite, les étudiants sont mis face à un problème mathématique difficile et accompagnés dans leur recherche en vue de le résoudre avec l'aide de la machine.    Organisation générale de l’UE : 11 séances de TP puis une séance d'exposés. Les premières séances de TP sont dédiées à des fiches guidées sous SageMath (utilisant Jupyter) permettant de se familiariser avec le langage et introduisant petit à petit l'interaction avec les mathématiques. Puis les étudiants travaillent en groupe sur des projets basés sur des questions mathématiques laissant la place à de nombreuses pistes de recherche et dont la résolution passe par la programmation (simulation, création d'algorithmes, calcul numérique, etc)\r\n                      \r\n                                \r\n            Pré-requis :\r\n                          * compétence de base en programmation impérative (conditions, boucles, fonctions, etc), peu importe le langage    * compétence lycée en mathématique (signification d'une équations différentielles, analyse de fonctions, dénombrement élémentaire, probabilité discrète)\r\n                      \r\n                                \r\n            Semestre calendaire :\r\n                          S2\r\n                      \r\n                                                            \r\n            Modalités pédagogiques particulières\r\n                          * licence simple : 24h (11x2h de TP + 1 séance d'exposés)     * licence double : 30h eqtd. Les étudiants ont 11 séances de 3h de TP + une séance d'exposés. Certaines séances sont en autonomie partielle (1 enseignant pour 2 groupes)"
    },
    {
      "Matières": "Logique et démonstrations assistées par ordinateur",
      "ECTS": 4,
      "Cours": 12,
      "TD": "",
      "TP": 12
    },
    {
      "Matières": "Logique et démonstrations assistées par ordinateur\r\n\r\n\r\n                            \r\n        Langue d'enseignement :\r\n          Français\r\n        \r\n      \r\n                          \r\n        ECTS :\r\n          4\r\n        \r\n      \r\n            \r\n      Détail du volume horaire :\r\n                        \r\n            Cours :\r\n                          12\r\n                      \r\n                                              \r\n            Travaux pratiques :\r\n                          12\r\n                      \r\n                                                                                                      \r\n  \r\n              \r\n              \r\n                      \r\n      Modalités d'organisation et de suivi  :\r\n                                                    \r\n        \r\n      Objectifs pédagogiques visés :\r\n                        \r\n            Objectifs d'apprentissage :\r\n                          \r\n               Approfondir la compréhension du concept de démonstration en mathématique.\r\n            \r\n\r\n               Maîtriser les différents types d’énoncés et de connecteurs logiques, pouvoir les utiliser et les démontrer.\r\n            \r\n\r\n                  Rédiger sur papier une démonstration correcte et facile à lire pour des énoncés portant sur les objets mathématiques rencontrés au lycée ou au premier semestre.\r\n\r\n\r\n                      \r\n                                \r\n            Programme/plan/contenus :\r\n                          La pratique mathématique est faite d'incessants aller-retours entre la compréhension intuitive des objets mathématiques et l'écriture de définitions et de démonstrations précises et rigoureuses. Ce cours se concentre sur cet aspect plutôt que sur l'apprentissage de nouveaux concepts et théorèmes. Il s’appuie sur l’utilisation du logiciel Lean qui permet à la fois de vérifier et de guider les démonstrations, mais l’objectif final reste l’écriture de démonstrations traditionnelles sur papier. Partant des calculs du lycée, le cours introduit progressivement les différents connecteurs logiques et types de raisonnements. Il reprend dans ce contexte de nombreuses démonstrations du cours d’analyse réelle du premier semestre."
    }
  ]